Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum
Defines the different profile item types.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.ALL_PROFILES
All profiles.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_UNKNOWN
The unknown profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_I
The I profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_L
The L profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_Z
The Z profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_U
The U profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_PL
The plate profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_D
The circular section profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_PD
The circular hollow section profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_P
The rectangular hollow section profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_C
The C profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_T
The T profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_HK
The welded box profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_HQ
The HQ profile

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_ZZ
The ZZ profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_CC
The CC profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_CW
The CW profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_CU
The CU profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_EB
The EB profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_BF
The BF profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_SPD
The SPD profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_EC
The EC profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_ED
The ED profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_EE
The EE profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_EF
The EF profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_EZ
The EZ profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_EW
The EW profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_POLYGON_PLATE
The polygon plate profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_FPL
The FPL profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_SP
The SP profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_RCDL
The RCDL profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_RCXX
The RCXX profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_RCL
The RCL profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_RCDX
The RCDX profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_RCX
The RCX profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_USER_DEFINED
The user-defined, fixed profile.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum.PROFILE_USER_PARAMETRIC
The user-defined, parametric profile.